Repository: xianqusite/fugai
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: vi

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..title
vi: Tìm hiểu cách hiển thị các mục ưa thích của bạn theo ba cách khác nhau

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..title
vi: Tab Mục ưa thích

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph75
vi: Tab này chứa ba phần của các mục ưa thích, được sắp xếp theo một cách giống nhau. Có một tiêu đề ở trên cùng, một [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) ở bên dưới đó hiển thị hình ảnh, văn bản hoặc màu theo chiều ngang và một `Divider` để chia tách các phần.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph76
vi: Mặc dù có rất nhiều mã giống nhau trong từng phần, nhưng có một số khác biệt quan trọng cần chỉ ra.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph77
vi: Hãy dành một phút để khám phá mã và xem bạn có thể chỉ ra không:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..UnorderedList2..Paragraph78
vi: Văn bản, hình ảnh và màu được căn chỉnh về một bên như thế nào?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..UnorderedList2..Paragraph79
vi: Tại sao bạn có thể cuộn các món ăn sang hai bên không?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..UnorderedList2..Paragraph80
vi: Các màu được ẩn như thế nào?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph81
vi: Bắt đầu bằng việc xem văn bản, hình ảnh và màu căn chỉnh về một bên như thế nào.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph82
vi: Hãy lưu ý rằng mỗi phần sử dụng một [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) để hiển thị nội dung và một [ký tự khoảng trống](doc://com.apple.documentation/documentation/swiftui/spacer) ở cuối, tại đây …

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph83
vi: … và tại đây …

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph84
vi: … và tại đây …

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph85
vi: … và đây! Như bạn có thể thấy, sử dụng một `HStack` và `Spacer` sẽ căn chỉnh các chế độ xem về một bên.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph86
vi: Thử di chuyển `Spacer` đến vị trí đầu tiên trong ngăn xếp. Bạn có đoán được điều gì xảy ra không?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph87
vi: Tiếp tục thực hiện để tìm ra câu trả lời cho hai câu hỏi khác trong khi bạn thử nghiệm với mã.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..title
vi: Tùy chỉnh tab Mục ưa thích

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..title
vi: Tab Mục ưa thích

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph88
vi: Bắt đầu bằng việc sửa mã để thể hiện các sở thích của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph89
vi: Hãy lưu ý rằng biểu tượng chỉ là các [Chuỗi](glossary://String) văn bản! Đó là lý do tại sao có các dấu ngoặc kép xung quanh biểu tượng.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph90
vi: Nếu bạn lựa chọn thêm rất nhiều sở thích, hãy thử xóa `Spacer` hoặc sửa khoảng cách của `HStack` để xem bạn có thể đặt vừa tất cả các sở thích trên màn hình không. Nếu bạn không thể thì phần tiếp theo có thể giúp được bạn. 😉

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph91
vi: Bạn có biết tại sao bạn có thể cuộn các món ăn sang hai bên không?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph92
vi: Đúng! Phần này sử dụng một `ScrollView`. `ScrollView` cuộn dọc theo mặc định, nhưng bạn có thể làm cho chúng cuộn ngang, giống như bạn nhìn thấy tại đây.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph93
vi: Sử dụng `ScrollView` bằng cách thêm nhiều món ăn ưa thích của bạn vào danh sách và xem điều gì xảy ra khi các mục vượt quá chiều rộng của màn hình.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock19
vi: Text("🍉") .font(.system(size: 48)) Text("🥖") .font(.system(size: 48)) Text("🍙") .font(.system(size: 48)) Text("🍫") .font(.system(size: 48)) Text("🥞") .font(.system(size: 48))

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph94
vi: Bây giờ, hãy sửa biểu tượng đồ ăn để bao gồm tất cả các món ăn ưa thích của bạn! 😋

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph95
vi: Bạn đã tìm ra cách ẩn các màu chưa?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph96
vi: Nếu không, hãy dừng xem. Để thêm nội dung bên dưới một tiêu đề, bạn có thể sử dụng một `DisclosureGroup` giống như bạn nhìn thấy tại đây.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph97
vi: Bây giờ, hãy thay đổi màu thành màu ưa thích của bạn!

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph98
vi: Thay thế các màu trong mã bằng bất kỳ màu nào mà bạn chọn. Để duy trì cùng một kích cỡ và hình dạng của các màu khác trong danh sách, không xóa các trình sửa đổi `frame` và `cornerRadius` bên dưới các màu.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph99
vi: Để thay thế màu, bạn có thể sử dụng các màu SwiftUI. Mở thư viện màu (🎨) trong thanh công cụ để xem tất cả các tùy chọn của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph100
vi: Hoặc bạn có thể sử dụng các màu RGB (đỏ, lục, lam) như sau:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock20
vi: Color(red: 0.6, green: 0.8, blue: 0.8)

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph101
vi: Hoặc các sắc thái màu xám:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock21
vi: Color(white: 0.7)

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph102
vi: Hoặc các giá trị HSB (sắc độ, độ bão hòa và độ sáng) để định nghĩa các màu:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock22
vi: Color(hue: 0.9, saturation: 0.5, brightness: 0.9)

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph103
vi: Nếu bạn muốn cung cấp cho mọi người gợi ý về màu ưa thích của mình thì bạn có thể thay đổi tiêu đề bằng trình sửa đổi `accentColor`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph104
vi: Thêm trình sửa đổi này vào tận cuối của `DisclosureGroup`, bên dưới nhãn, dấu ngoặc nhọn (`}`) và trình sửa đổi `.padding()`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock23
vi: .accentColor(.purple)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..title
vi: Tab Sự thật thú vị

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..title
vi: Tìm hiểu về các nút và Trạng thái

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..title
vi: Tab Sự thật thú vị

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph105
vi: Trong `FunFactsView`, bạn sẽ sử dụng một [Nút](doc://com.apple.documentation/documentation/swiftui/button) để thay đổi một chuỗi sự thật thú vị bất kỳ lúc nào có người chạm vào đó.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph106
vi: Bên trong `VStack`, bạn sẽ nhìn thấy một nút. Khi bạn chạm vào nút này, nút sẽ gán một sự thật ngẫu nhiên từ dãy `allFunFacts` cho `funFact`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph107
vi: `??` cung cấp một `String` mặc định trong trường hợp dãy `allFunFacts` trống.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph108
vi: Biến `funFact` đặc biệt vì biến đó sử dụng một [thuộc tính trạng thái](glossary://state%20property), tự động cập nhật chế độ xem `Text` bên dưới bằng một giá trị mới bất kỳ lúc nào giá trị của `funFact` thay đổi.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph109
vi: Chế độ xem `Text` này hiển thị sự thật thú vị. Chế độ xem này sử dụng biến `funFact` làm [đối số](glossary://argument) để có thể hiển thị một sự thật thú vị mới bất kỳ lúc nào giá trị thay đổi.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..title
vi: Biến thành của bạn

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..title
vi: Tab Sự thật thú vị

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph110
vi: Hãy bắt đầu bằng cách thêm một loạt sự thật thú vị và hài hước vào dãy `allFunFacts`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph111
vi: Đảm bảo thêm một dấu phẩy ở cuối mỗi `String` để cho biết rằng bạn đang bắt đầu một mục mới trong dãy.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph112
vi: Trang này đẹp, nhưng để cải thiện thiết kế, hãy thêm nền. Để thực hiện việc này, hãy sử dụng `ZStack` trong mã để thêm một `Image` bên dưới nội dung.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph113
vi: Thêm một `Image` giữa `ZStack` và `VStack`, giống như sau:

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock24
vi: ZStack { Image("Green") VStack {

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph114
vi: Với màu nền được đặt, đã đến lúc làm việc với vấn đề tạo kiểu cho nút.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph115
vi: Hãy dùng thử một, hai hoặc tất cả các trình sửa đổi nút này. Thêm trình sửa đổi này bên dưới dấu ngoặc nhọn đóng (`}`) của `Button`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock25
vi: .padding()

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock26
vi: .foregroundColor(.white)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock27
vi: .background(.blue)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock28
vi: .clipShape(RoundedRectangle(cornerRadius: 15))

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock29
vi: .shadow(radius: 15)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock30
vi: .font(.title2)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph116
vi: Bạn đã sử dụng tất cả những trình sửa đổi này trước đây. Hầu hết các trình sửa đổi hoạt động khi được áp dụng cho bất kỳ kiểu `View` nào; đây chính là nét đẹp và tính đơn giản của SwiftUI!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..title
vi: Sử dụng và tạo các tab

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..title
vi: Thiết lập một giao diện dạng tab

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..title
vi: Giao diện dạng tab

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph117
vi: Để tạo ra một giao diện người dùng dạng tab, hãy đặt các chế độ xem bên trong một [TabView](doc://com.apple.documentation/documentation/swiftui/tabview), sau đó liệt kê từng mục tab mà bạn muốn có trong giao diện của mình.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph118
vi: Để tạo một tab, hãy tạo ra một [thể hiện](glossary://instance) của chế độ xem mà bạn muốn hiển thị khi có người chạm vào một tab. Chế độ xem tab đầu tiên trong danh sách là `HomeView` nên đó là tab đầu tiên mà bạn nhìn thấy khi ứng dụng khởi chạy.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph119
vi: Sau khi xác định chế độ xem mà bạn muốn hiển thị — trong trường hợp này là `HomeView` — hãy sử dụng một trình sửa đổi `tabItem` và chuyển vào `Label` như tab hiển thị. Không có `tabItem`, tab cho chế độ xem này xuất hiện ở trạng thái trống.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph120
vi: Trình sửa đổi `tabItem` chỉ chấp nhận các chế độ xem [Nhãn](doc://com.apple.documentation/documentation/swiftui/label), [Văn bản](doc://com.apple.documentation/documentation/swiftui/text) và [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image). Việc bao gồm bất kỳ kiểu chế độ xem nào khác, ví dụ như [Nút](doc://com.apple.documentation/documentation/swiftui/button) sẽ dẫn đến một mục tab trống.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..title
vi: Tạo ra tab của riêng bạn

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..PageCreate Your Own Tab..title
vi: Tạo ra tab của riêng bạn

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..PageCreate Your Own Tab..Paragraph121
vi: Bây giờ, đã đến lúc thêm một tab mới hoàn toàn thuộc về bạn! Hãy bắt đầu bằng cách cập nhật tệp `YourTab`. Sử dụng những gì bạn đã học được để tạo ra UI của mình hoặc lấy ý tưởng từ các dự án khác trong Bộ sưu tập ứng dụng!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..PageCreate Your Own Tab..Paragraph122
vi: Thể hiện sự sáng tạo của bạn tại đây, sau đó tiến hành thử nghiệm tiếp theo để thêm chế độ xem của bạn vào thanh tab.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..title
vi: Thêm tab của bạn

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd Your Tab..title
vi: Thêm tab của bạn

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd Your Tab..Paragraph123
vi: Thêm tab mới của bạn bằng cách thêm một chế độ xem khác vào `TabView`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd Your Tab..CodeBlock31
vi: YourTab()

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..title
vi: Thêm một tab

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph124
vi: Sau đó, sử dụng trình sửa đổi `tabItem` để cung cấp cho chế độ xem của bạn một `Label` sẽ hiển thị trong danh sách các tab ở dưới cùng của ứng dụng.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..CodeBlock32
vi: .tabItem { Label("Tab của bạn", systemImage: "heart.fill") }

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph125
vi: Sau đó, kiểm tra để đảm bảo ứng dụng hoạt động!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph126
vi: Cuối cùng, thay đổi tên, biểu tượng ứng dụng và màu nhấn của ứng dụng. Để thực hiện việc này:

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph127
vi: Mở thanh bên ở bên trái.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph128
vi: Chạm vào Cài đặt ứng dụng ở gần đầu thanh bên.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph129
vi: Thay đổi tên của ứng dụng.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph130
vi: Chọn một màu nhấn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph131
vi: Chạm vào Trình giữ chỗ và chọn một biểu tượng mới hoặc chạm vào Tùy chỉnh để tải lên biểu tượng của riêng bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph132
vi: Sau đó, kiểm tra bản xem trước để đảm bảo rằng tên và các nhãn tab của bạn đã được cập nhật.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph133
vi: Nếu bạn đang sử dụng máy Mac thì bạn cũng có thể cài đặt ứng dụng của mình trên máy tính trong Cài đặt ứng dụng!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph134
vi: Mở lại Cài đặt ứng dụng, cuộn đến dưới cùng và bấm vào “Cài đặt trên máy Mac này” để kiểm tra ứng dụng của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PagePolish..title
vi: Tinh chỉnh

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PagePolish..Paragraph135
vi: Xem lại từng tab trong ứng dụng của bạn và đảm bảo rằng mọi thứ trông phù hợp và truyền tải thông điệp của bạn. Hãy đề nghị người khác khám phá ứng dụng của bạn để xem họ có gợi ý nào để cải thiện ứng dụng không.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PagePolish..Paragraph136
vi: Tiếp theo, hãy xem một số dự án khác trong Bộ sưu tập ứng dụng để tiếp tục xây dựng các kỹ năng SwiftUI của bạn.
