Repository: xianqusite/fugai
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: vi

source: GuideBook..title
vi: Giới thiệu về tôi

source: GuideBook..WelcomeMessageAbout Me..title
vi: Giới thiệu về tôi

source: GuideBook..WelcomeMessageAbout Me..Paragraph0
vi: Mẫu này hoàn toàn là về bạn hoặc bất kỳ thứ gì mà bạn muốn! Vậy nên hãy sẵn sàng chia sẻ điều gì đó đặc biệt, thú vị hoặc khác biệt trong khi học SwiftUI để hiển thị thông tin trên nhiều chế độ xem tab.

source: GuideBook..Guide0..StepAbout Me..title
vi: Giới thiệu về tôi

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph1
vi: ![](intro.png)

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph2
vi: Chào mừng đến ứng dụng Giới thiệu về tôi. Trong mẫu này, bạn sẽ học các khái niệm cơ bản về sử dụng [SwiftUI](glossary://SwiftUI) để tùy chỉnh nội dung trong một ứng dụng gồm bốn tab về … bất kỳ thứ gì mà bạn muốn! Trong khi bạn khám phá mẫu này, hãy thêm nội dung và tiến hành tất cả các thử nghiệm để thể hiện bản thân mình trong từng tab.

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph3
vi: Chế độ xem [tab](doc://com.apple.documentation/documentation/swiftui/tabview) giúp mọi người điều hướng qua ứng dụng của bạn bằng cách cho phép họ xem và chuyển đổi giữa nhiều chế độ xem.

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph4
vi: Thử chạm vào từng tab trong Bản xem trước ứng dụng: Trang chủ, Câu chuyện, Mục ưa thích và Sự thật thú vị.

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..GuideButtonStart Building..title
vi: Bắt đầu xây dựng

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..GuideButtonStart Building..description
vi: Mô tả AX cho nút

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..title
vi: Tab Trang chủ

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..title
vi: Khám phá các nguyên tắc cơ bản của mã SwiftUI

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..title
vi: Tab Trang chủ

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph5
vi: `HomeView` là tab đầu tiên trong ứng dụng của bạn và là thứ đầu tiên mà người khác nhìn thấy khi họ khởi chạy ứng dụng của bạn. Bạn đã thấy tab này hoạt động khi mở dự án lần đầu tiên.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph6
vi: Bạn có thể xem ứng dụng của mình theo hai cách:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..OrderedList0..Paragraph7
vi: Chạm vào nút Chạy (▶) trong thanh công cụ ở đầu Swift Playgrounds để khởi chạy ứng dụng của bạn. Nhấn biểu tượng Swift và sau đó Dừng để trở về mã.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..OrderedList0..Paragraph8
vi: Để xem trước ứng dụng của bạn, hãy mở tệp AboutMeApp. Để trở về hướng dẫn này và bản xem trước Trang chủ, hãy điều hướng quay lại tệp HomeView.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph9
vi: Trước khi bạn tùy chỉnh [giao diện người dùng](glossary://user%20interface), là diện mạo trực quan của ứng dụng, hãy xem ứng dụng được xây dựng như thế nào.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph10
vi: Để tạo ra một giao diện, bạn sẽ sử dụng các [chế độ xem](glossary://view), là các khối xây dựng của giao diện người dùng của ứng dụng, ví dụ như văn bản, hình ảnh và hình dạng. Các chế độ xem cũng có thể đóng vai trò là các bộ chứa, cho phép bạn ghép chúng lại với nhau bằng cách đặt một chế độ xem bên trong một chế độ xem khác. Trong tệp này, `HomeView` là chế độ xem mà bạn đang tùy chỉnh và chứa các chế độ xem khác, như `Text` và `Image`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph11
vi: Mỗi chế độ xem mới cần có một [phần thân](glossary://body), là nơi bạn thêm tất cả các chế độ xem mà bạn muốn hiển thị. Vì chế độ xem cần hiển thị nội dung nào đó nên `body` luôn chứa ít nhất một chế độ xem. Ba chế độ xem phổ biến là:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList0..Paragraph12
vi: [VStack](doc://com.apple.documentation/documentation/swiftui/vstack), một chế độ xem sắp xếp nội dung theo chiều dọc từ trên xuống dưới trên màn hình.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList0..Paragraph13
vi: [Văn bản](doc://com.apple.documentation/documentation/swiftui/text), một chế độ xem hiển thị một [Chuỗi](glossary://String). Đảm bảo bao gồm dấu ngoặc kép xung quanh văn bản trong Chuỗi của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList0..Paragraph14
vi: [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image), một chế độ xem hiển thị một hình ảnh như PNG hoặc JPEG hay các biểu tượng từ [Ký hiệu SF](https://developer.apple.com/sf-symbols/).

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph15
vi: Một điều khác cần lưu ý là các [trình sửa đổi chế độ xem](glossary://modifier). Bạn có thể nhìn thấy những trình sửa đổi này trong các danh sách trong một số chế độ xem. Các trình sửa đổi chế độ xem thay đổi giao diện và hoạt động của một chế độ xem.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph16
vi: Khi bạn sửa đổi một chế độ xem, hãy bắt đầu một dòng mới bên dưới chế độ xem và thêm mã của bạn, giống như bạn nhìn thấy tại đây.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph17
vi: `Image` của bạn sử dụng hai trình sửa đổi để đảm bảo hình thức và hoạt động của hình ảnh giống như bạn dự kiến:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList1..Paragraph18
vi: Trình sửa đổi [có thể định cỡ lại](doc://com.apple.documentation/documentation/swiftui/image/resizable(capinsets:resizingmode:)) cho phép hình ảnh điều chỉnh theo không gian có sẵn trên màn hình; ngược lại, hình ảnh xuất hiện với kích cỡ đầy đủ, có thể rất lớn. Trình sửa đổi này cũng cho phép bạn sử dụng các trình sửa đổi khác trên hình ảnh, ví dụ như `scaledToFit`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList1..Paragraph19
vi: [scaledToFit](doc://com.apple.documentation/documentation/swiftui/path/scaledtofit()) yêu cầu hình ảnh duy trì đúng tỷ lệ khung hình cho không gian có sẵn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph20
vi: Tiếp tục thực hiện để bắt đầu tùy chỉnh ứng dụng!

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..title
vi: Tùy chỉnh tab Trang chủ

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..Paragraph21
vi: Bắt đầu với việc thay thế `Image` bằng một ảnh mới.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..Paragraph22
vi: Để thêm ảnh của chính bạn trên iPad:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph23
vi: Mở thanh bên ở bên trái.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph24
vi: Chạm vào nút Thêm tệp ở đầu thanh bên.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph25
vi: Chạm vào Ảnh để thêm một nội dung ảnh từ ứng dụng Ảnh của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph26
vi: Đặt tên cho ảnh của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph27
vi: Thay thế tên `Placeholder` trong dấu ngoặc kép bằng tên ảnh của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..title
vi: Tùy chỉnh tab Trang chủ

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph28
vi: Được rồi, bây giờ là phần thú vị. Hãy thử những sửa đổi này lần lượt để thay đổi hình dạng ảnh của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph29
vi: Thêm một trong các trình sửa đổi sau đây ở bên dưới các trình sửa đổi hình ảnh khác của bạn. Khi bạn làm việc qua chúng, hãy loại bỏ bất kỳ mã nào không mong muốn bằng cách đặt hai dấu gạch chéo (`//`) ở đầu dòng.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock0
vi: .clipShape(Circle())

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock1
vi: .clipShape(RoundedRectangle(cornerRadius: 10))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock2
vi: .clipShape(Ellipse())

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock3
vi: .clipShape(Capsule())

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph30
vi: Sử dụng cùng một hình dạng với ảnh của bạn, hãy thêm đường viền xung quanh hình ảnh bằng trình sửa đổi `overlay`, tạo lớp một chế độ xem ở phía trước một chế độ xem khác.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph31
vi: Thêm mã này bên dưới trình sửa đổi `clipShape` của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock4
vi: .overlay( Circle() .stroke(.yellow, style: StrokeStyle(lineWidth: 15)) )

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph32
vi: Thử thay đổi màu hoặc `lineWidth` của lớp phủ.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph33
vi: Bây giờ ảnh của bạn đã được đặt, hãy cập nhật văn bản ở bên dưới. Chế độ xem [Văn bản](doc://com.apple.documentation/documentation/swiftui/text) là một [chế độ xem tích hợp](glossary://built-in%20view) khác được cung cấp bởi SwiftUI.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph34
vi: Sửa `"Tên của bạn"` thành tên của bạn hoặc tiêu đề dự án của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph35
vi: Chọn một kiểu phông chữ cho chế độ xem `Text` của bạn. Sử dụng tự động hoàn thành để tìm các phông chữ khác:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList2..Paragraph36
vi: Xóa `.title` (bao gồm dấu chấm, `.`).

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList2..Paragraph37
vi: Nhập vào dấu chấm (`.`) để xem và chọn từ các tùy chọn có sẵn, ví dụ như `caption` hoặc `largeTitle`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph38
vi: Thay vì chọn một cỡ chữ tiêu chuẩn, bạn có thể sử dụng một phông chữ tùy chỉnh. Hãy loại bỏ hoặc sửa trình sửa đổi `font` để trông giống như sau:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock5
vi: .font(.custom(FontNames.helvetica, size: 40))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph39
vi: Để xem các tùy chọn phông chữ của bạn:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList3..Paragraph40
vi: Xóa `.helvetica`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList3..Paragraph41
vi: Nhập vào `.` để xem và chọn một phông chữ mới.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph42
vi: Hãy xem phần [Phông chữ hệ thống](https://developer.apple.com/fonts/system-fonts/) để tìm các phông chữ khác, sau đó thêm chúng vào `FontNames` ở cuối tệp.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph43
vi: Tiếp tục bằng cách thêm một số trình sửa đổi chế độ xem `Text` khác!

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock6
vi: .foregroundColor(.blue)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock7
vi: .padding(30)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock8
vi: .background(Color(red: 0.75, green: 0.75, blue: 0.75))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock9
vi: .cornerRadius(15)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock10
vi: .shadow(color: .blue, radius: 30)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph44
vi: Phối kết hợp các chế độ xem và trình sửa đổi như ngăn xếp, Ký hiệu SF, biểu tượng và hãy nhớ thêm một màu nào đó để làm nổi bật tên của bạn!

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph45
vi: Thử thêm ví dụ này vào cuối `VStack` của bạn, giữ lại bất kỳ phần nào mà bạn thích và xóa phần còn lại:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock11
vi: HStack { Image(systemName: "sparkles") .foregroundColor(.yellow) Text("Vui vẻ") .font(.largeTitle) .foregroundColor(.mint) .padding() Image(systemName: "sparkles") .foregroundColor(.yellow) }

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph46
vi: Để tìm các Ký hiệu SF khác, hãy mở thư viện ký hiệu (✪) trong thanh công cụ để xem tất cả các tùy chọn của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph47
vi: Tiếp tục thử nghiệm bằng cách thêm họa tiết hoặc màu nền.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph48
vi: Thêm trình sửa đổi này bên dưới dấu ngoặc nhọn đóng (`}`) của `VStack` và trình sửa đổi `padding`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock12
vi: .background(Image("Blue"))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph49
vi: Bây giờ, hãy thử nghiệm với tất cả những gì mà bạn đã học được đến nay để làm cho chế độ xem này hoàn toàn thuộc về bạn!

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..title
vi: Tab Câu chuyện

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..title
vi: Tạo ra một chuyện kể dạng cuộn

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..title
vi: Tạo ra một chuyện kể dạng cuộn

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph50
vi: Đây là `StoryView`, là nơi bạn có thể hiển thị một câu chuyện về bất kỳ thứ gì mà bạn muốn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph51
vi: Có một số mã khởi đầu tại đây để bạn khám phá. Hãy thử vuốt lên và xuống trong bản xem trước để kiểm tra cách hoạt động của mã này.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph52
vi: Trong khi đang vuốt lên và xuống, có thể bạn nhận thấy rằng chế độ xem được cuộn! [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) là một chế độ xem hữu ích nếu bạn dự định có nhiều nội dung, ví dụ như một bài viết trong ứng dụng tin tức. `ScrollView` giúp mọi người có thể cuộn qua nội dung của bạn nếu nội dung đó vượt quá chiều dài của màn hình.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph53
vi: Một phần thú vị khác của trang này là bố cục và tất cả các trình sửa đổi giúp thực hiện việc đó.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph54
vi: Thử chú thích một trình sửa đổi mỗi lần để xem việc đó ảnh hưởng đến hoạt động của chế độ xem như thế nào.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph55
vi: Khi bạn đã sẵn sàng, hãy tiếp tục học những cách mới để thu hút độc giả và làm sống động câu chuyện của mình.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..title
vi: Thử nghiệm với nhiều bố cục và điểm thu hút sự chú ý

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..title
vi: Thử nghiệm với nhiều bố cục và điểm thu hút sự chú ý

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph56
vi: Thu hút độc giả của bạn bằng một tiêu đề hấp dẫn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph57
vi: Nhập mã khởi đầu bằng cách thay thế `"Câu chuyện của bạn"` bằng một tiêu đề hấp dẫn. Thay thế `"Tên của bạn"` bằng tên của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph58
vi: Sử dụng các [Bộ chia](doc://com.apple.documentation/documentation/swiftui/divider) để thêm các phần vào câu chuyện của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph59
vi: Thêm mã này bên dưới các chế độ xem văn bản và trình sửa đổi bên trong `VStack`:

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock13
vi: Divider()

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph60
vi: Sử dụng các bộ chia tùy ý trong suốt câu chuyện của bạn để cung cấp không gian và nhấn mạnh các phần khác nhau trong câu chuyện của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph61
vi: Bây giờ, hãy dành thời gian để viết câu chuyện của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph62
vi: Thêm những chế độ xem này bên dưới bộ chia và sửa văn bản:

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock14
vi: Text("Mọi người đều biết rằng tôi chỉ yêu …") .padding([.top, .bottom]) Text("Siêu năng lực của tôi là …") .padding(.bottom)

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph63
vi: Trình sửa đổi `.padding` rất hữu ích trong việc đảm bảo có đủ không gian xung quanh từng phần tử trang của bạn. Hãy lưu ý cách sử dụng [dãy](glossary://array) để chỉ định phần đệm chỉ ở hai bên trong một trong cách trình sửa đổi phần đệm.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph64
vi: Tùy theo lượng nội dung mà bạn thêm, có thể bạn đã gặp phải một lỗi cho biết “Các đối số dư thừa tại các vị trí…” (hoặc có thể bạn sẽ sớm gặp phải). Đây là cách mà hệ thống cho biết rằng bạn có trên 10 chế độ xem bên trong một ngăn xếp. SwiftUI không hỗ trợ nhiều hơn 10 chế độ xem không được nhóm, nên bạn sẽ cần nhóm các mục!

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph65
vi: Thêm `Group` xung quanh các mục đi cùng nhau, ví dụ như tiêu đề của câu chuyện, tên của bạn và bộ chia. Để xem ví dụ, hãy đi tới bước tiếp theo.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock15
vi: Group { }

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph66
vi: Việc nhóm các mục không mang lại hiệu ứng hình ảnh trên UI của bạn, nhưng có thể giúp bạn theo dõi các phần khác nhau của câu chuyện, vậy nên hãy suy nghĩ về cách bạn nhóm các mục cùng nhau.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph67
vi: Người ta thường nói một hình ảnh có giá trị bằng cả ngàn lời nói, vậy nên hãy thêm các hình ảnh trong suốt câu chuyện của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph68
vi: Để làm cho bố cục của bạn sinh động hơn, hãy thử thêm các chế độ xem `Image` và `Text` bên trong một `HStack`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph69
vi: Thêm mã này bên dưới nhóm chế độ xem cuối cùng trong `VStack` của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock16
vi: Group { HStack { Text("Trong cuộc đời mình, tôi vô cùng biết ơn …") Image("Placeholder") .resizable() .scaledToFit() .cornerRadius(15) } }

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph70
vi: Thử sử dụng các bộ chia với văn bản có màu khác nhau để làm nổi bật hoặc nhấn mạnh các phần quan trọng trong câu chuyện của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph71
vi: Thêm mã sau đây bên dưới nhóm chế độ xem cuối cùng trong `VStack` để thử nghiệm.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock17
vi: Group { Divider() Text("Tận dụng tối đa phần này") .font(.title3) .foregroundColor(.cyan) Text("Đây là nơi bạn viết nội dung mà bạn thực sự muốn nhấn mạnh. Điều mà bạn muốn mọi người ghi nhớ sau khi đọc câu chuyện của mình.") .italic() Divider() }

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph72
vi: Nếu bạn muốn thêm một câu chuyện khác vào tab này, hãy thêm một `VStack` khác bên trong `ScrollView`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock18
vi: VStack(alignment: .leading) { Group { Text("Một câu chuyện khác") .font(.largeTitle) Text("Tác giả") .font(.subheadline) .foregroundColor(.secondary) Divider() } } .padding() .frame(maxWidth: .infinity) .background(in: RoundedRectangle(cornerRadius: 15)) .padding()

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph73
vi: Bây giờ, hãy đặt tất cả cùng nhau để làm sống động câu chuyện của bạn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph74
vi: Tiếp tục thêm văn bản, bộ chia, hình ảnh, ngăn xếp, nhóm, màu, phông chữ và đề mục để làm cho câu chuyện của bạn sinh động và thú vị hơn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..title
vi: Tab Mục ưa thích
